런타임 시점에서의 자바 프로그램 메모리 영역
1. 스레드 비 공유 메모리
- 프로그램 카운터 영역
  - 자바 가상 머신에서의 멀티 스레딩 상황에서 여러 스레드가 CPU를 교대로 사용
  - 이 때 각 스레드가 멈춘 시점, 즉 컨택스트 스위칭의 기준점에 대한 역할을 하는 것이 프로그램 카운터
  - 프로그램 카운터는 각각의 스레드에 존재하며 서로 영향을 주지 않는 독립된 영역
  - 실제로는 실행중인 바이트 코드의 명령어 주소가 프로그램 카운터에 기록
- 스택 영역
  - 가상 머신 스택
    - 자바 메서드를 호출 할 때 사용되는 메모리 영역
    - 일반적으로 스택은 지역 변수 테이블을 지칭
      - 지역 변수 테이블에는 "기본 데이터 타입, 객체 참조, 반환 주소 타입"을 저장
      - 이러한 값들을 저장할 때 지역 변수 슬롯을 이용하며, 지역 변수 슬롯은 일반적으로 32비트
      - 슬롯 크기를 64 비트로 구성할 수 있으며 자바 가상 머신을 어떻게 구성하느냐에 따라 지역 변수 슬롯의 크기를 변경할 수 있음
    - 자바 가상 머신은 각 메서드가 호출 될 때마다 "지역 변수 테이블, 피연산자 스태 , 동적 링크, 메서드 반환 값 등등" 정보를 스택 프레임에 Push(저장)
    - 자바 가상 머신은 각 메서드가 호출 된 후 종료되면 스택 프레임에서 Pop(제거)
  - 네이티브 메서드 스택
    - 네이티브 메서드를 실행할 때 사용되는 메모리 영역
    - 네이티브 메서드란 자바에서 운영체제와 같은 Row 레벨을 사용할 때 호출되는 메서드를 의미

2. 스레드 공유 메모리
- 힙 영역
  - 해당 메모리의 유일한 목적은 객체 인스턴스를 저장하는 것
  - 자바 애플리케이션의 메모리 영역 중 가장 큰 영역
  - 가비지 컬렉터가 관리하는 메모리 영역
  - 모든 객체가 저장되기 때문에 메모리 영역을 효율적으로 사용하는 것이 중요
    - 힙은 모든 스레드가 공유하기에, 각 스레드에서 로컬 할당 버퍼라는 개념을 이용
  - 힙 메모리 영역은 정적이지 않으며 동적인 메모리 영역
- 메서드 영역
  - 힙 영역과 마찬가지로 정적이지 않고 동적인 메모리 영역
  - "타입 정보, 상수, 정적 변수, 컴파일 코드 캐시 등등"을 저장하는 영역
  - 메서드 영역은 주로 "상수, 타입"이라서 가비지 컬렉터게 가비지 컬렉션을 하는 경우는 거의 없는 상태
  - 하지만 데이터가 영구적이지는 않는 경우도 있기에 가비지 컬렉션을 하는 경우가 존재
  - 런타임 상수 풀
    - 메서드 영역 안에 존재하는 메모리 영역
    - 정적이지 않고 동적인 메모리 영역
    - 클래스 버전, 필드, 메서드, 인터페이스 등등 클래스 파일에 대한 정보가 존재하는 메모리 영역
    - 자바 가상머신이 클래스를 로딩할 때 저장해야 할 데이터들을 해당 영역에 적재

3. 자바 가상 머신에서의 객체 생성 과정
  1) "new" 코드가 있는 경우 런타임 상수 풀에서 해당 클래스 정보가 있는지 확인
  2) 런타임 상수 풀에서 해당 클래스가 loading, resolve, initialize 되었는지 확인
  3) 로딩이 완료 되지 않았다면 클래스 로딩/로딩이 완료 되었다면 해당 객체를 메모리에 담을 준비 진행
  4) 해당 객체의 크기만큼 힙 메모리에 할당(저장)
  - 이 때 어디에 할당 할지는 포인터를 이용하여 진행하는데 멀티 쓰레딩 상황에서는 객체 생성과 소멸이 빈번히 진행
    - 원자적으로 계산하여 포인터 할당
  5) init 메서드(생성자)가 호출되어 객체 생성(자바 Application에서 생성 됨을 의미)

4. 객체 메모리 레이아웃
- 힙에 저장 될 때 객체는 3개의 영역으로 나뉘어져 저장
  1) 객체 헤더
  - 마크 워드: 객체 해시 코드, 락 레코드, 객체 세대 나이 등등..
  - 클래스 워드: 객체가 어디 있는지 알 수 있는 클래스 포인터가 저장 
  2) 인스턴스 데이터
  - 인스턴스 데이터: 객체가 실제로 담고 있는 정보로 필드 내용, 부모 클래스 유무.. 등등
  3) 정렬 패딩
  - 특별한 의미 없는 것으로 고정된 바이트를 채우기 위한 패딩

5. 자바 가상 머신 관점에서의 객체 접근 방법
 1) 핸들 포인터 방식: 자바 스택(참조) -> 자바 힙(인스턴스 포인터/타입 포인터) -> 힙(객체 인스턴스 데이터)/메서드 영역(객체 타입 데이터)
 2) 다이렉트 포인터 방식: 자바 스택(참조) -> 자바 힙(인스턴스 데이터/타입 포인터) -> 메서드 영역(객체 타입 데이터)

6. 더 나아가서
- StackoverflowError
  - 스레드가 요청한 스택 깊이가 가상 머신이 허용하는 깊이보다 클 경우 발생
- OutOfMemoryError
  - 스택을 확장하려는 시점에 여유 메모리가 충분하지 않는 경우 발생
- 가비지 컬렉터
  - 메모리 사용 후 남은 메모리를 제거하는 것
  - 가비지 컬렉터에 대한 설계는 세대에 따라 설계 되어 시간 순서대로 가비지 컬렉터를 명명
    - old generation
    - new generation
    - permenent generation
    - eden space
    - from survivor space
    - to survivor space
